### Aagedals default apps


## Setup taps and cask —— Activate Homebrew Cask Repositories
tap "homebrew/bundle" # Needed for automated reinstall with MAS
tap "aagedal/casks" # Needed for Aagedal Media Converter

# tap "koekeishiya/formulae" # Needed for Yabai and skhd
# tap "romkatv/powerlevel10k" # Terminal theme repo. Probably not needed.


#—————————————————————————————————————————————————————————————

## Command Line / Terminal Apps and tools

# General
brew "mas" # Application to install apps from the App Store using CLI
brew "powerlevel10k" # Terminal theme
brew "lsd" # Better ls command. With icons.
brew "zsh-syntax-highlighting" # Terminal syntax highlight
brew "zsh-autosuggestions" # Terminal auto complete


# Media
brew "ffmpeg" # Convert almost all video formats in existence.
brew "exiftool" # Read or write ALL metadata from image files.
brew "yt-dlp" # Download all web videos
brew "imagemagick" # CLI tool for image conversion.

# Development
brew "git" # Working with code and GitHub
brew opencode # Very good terminal AI agent interface


# Utilities

brew "wget" # Quickly download a file without a web browser
brew "eza" # Better ls
brew "zoxide" # Better cd


brew "btop" # Better terminal activity monitor
brew "ranger" # Terminal file manager
brew "speedtest-cli" # Terminal speed test


# Install fonts for powerlevel10k (optional)
cask "font-hack-nerd-font" # Example font
cask "font-meslo-lg-nerd-font" # Necessary for Wezterm Setup


# Window management
#brew "nikitabobko/tap/areospace" # Aerospace, yabai and skhd replacement.




#—————————————————————————————————————————————————————————————

## GUI Apps

# General necessities
cask "1password" # The best password manager. Require a subscription.
cask "helium-browser" # Minimalist and private degoogled Chromium browser. (unfortunately no vertical tab bar)
cask "obsidian" # Free, scalable note-taking and writing application.
cask "raycast" # Fast app launching, clipboard history, window management, AI quick-fixes


# Creative
cask "adobe-creative-cloud" #Adobe app manager for installing Photoshop, Premiere Pro, Bridge and Lightrooom.
cask "affinity" # Free image editing software Affinity Studio. Alternative to Photoshop, but worse at RAW image editing.
cask "blender" # Free open source 3D modelling and animation software.


# Media tools
cask "aagedal-media-converter"
cask "shutter-encoder" # Free media conversion app with web video download
cask "iina" # Video player based on mpv, but optimized for macOS. Supports as many formats as VLC, but looks better.
cask "obs" # Screenrecording tool with audio meters and custom PiP
cask "adobe-dng-converter" # Tool to convert RAW files to DNG


# Development
cask "claude-code" # Very good AI agent terminal interface.
cask "wezterm" # Really fast terminal
cask "zed" # Fast and open source code editor with integrated AI.
cask "xcode" # Swift UI programming
cask "docker-desktop" # Run Docker-images.


# Social / communication
cask "discord" # Gaming chat, Bellingcat, and app support channels
cask "slack" # Business communication


# Utilities
cask "keka" # App to uncompress and compress files. Unlike macOS native it also supports RAR.
cask "shottr" # Screenshotting tool – Licence in 1Pw
cask "betterdisplay" # More control of HDMI monitors. Able to setup a virtual monitor for clean OBS recording.


# Removed apps (may add again later)
# cask "arc" # Modern web browser with minimal UI. Good, but UI is a bit sluggish.
# cask "aerospace" # Window manager.
# cask "keycastr" # Tool to display button presses. Useful for screen recordings.
# cask "warp" # Better terminal with text edit terminal commands, but slightly less private than wezterm. Also slow to get ready.
# cask "stats" # Menu bar activity monitor
# cask "cursor" # Code editor with integrated AI.


#—————————————————————————————————————————————————————————————



## Mac App Store Apps

# General


# Creative
mas "Final Cut Pro", id: 424389933 # Fast video editor
mas "Logic Pro", id: 634148309 # Advanced music making program


# Media
mas "Elmedia Video Player", id: 1044549675 # Supports many file formats and chrome cast and airplay.
mas "MediaInfo", id: 510620098 # Check metadata of all image files. Pro licence can be restored.


# Office
mas "Microsoft Teams", id: 1091189122 # Video meetings.
mas "Microsoft Word", id: 462054704 # Writing app.
mas "Microsoft Excel", id: 462058435 # Spreadcheat app.
mas "Microsoft PowerPoint", id: 462062816 # Presentations.
mas "Microsoft Outlook", id: 985367838 # Mail and meeting calendar.
mas "Keynote", id: 409183694 # Presentation utility
mas "Numbers", id: 409203825 # Excel alternative with iCloud sync.
mas "Pages", id: 409201541 # Word alternative.


# Utilities
mas "Charmstone", id: 1563735522 # Smart shortcut when dragging files. Quickly move to common folders or open in common apps.
mas "Hidden Bar", id: 1452453066 # With all this cool apps the top right menu bar can become cluttered. This free app hides some of the clutter.
mas "Infuse", id: 1136220934 # Movie player connected to NAS
mas "DaisyDisk", id: 411643860 # Disk space analyzer


# Removed apps (may add again later)
# mas "Mountain Duck", id: 1024974133 # Mount FTP servers as local drives.
# mas "PopClip", id: 445189367 # Smart popup commands with text selection.
# mas "Ulysses", id: 1225570693 # Minimalist writing tool for novels. Require subscription for writing, but not reading.


#—————————————————————————————————————————————————————————————

## Other apps / instructions

## Adobe Creative Cloud
# Adobe Bridge
# Photoshop
# Premiere Pro


# Other apps that need manual installation
## Camerabits - Photo Mechanic 
## Blackmagic Design - DaVinci Resolve Studio – Can be automated via mas, but for python scripting it's best getting directly from Blackmagic Design.
