# Aagedals default apps

# Activate Homebrew Cask Repositories
tap "homebrew/cask" # Enabling installation of GUI apps with Homebrew.
tap "homebrew/bundle" # Needed for automated reinstall with MAS
tap "koekeishiya/formulae" # Needed for Yabai and skhd
tap "romkatv/powerlevel10k" # Terminal theme repo

# Command Line Apps
brew "git" # Working with code and GitHub
brew "zsh"
brew "ffmpeg" # Convert almost all video formats in existence.
brew "exiftool" # Read or write ALL metadata from image files.
brew "wget" # Quickly download a file without a web browser
brew "eza" # Better ls
brew "oxide" # Better cd
brew "tmux" # Terminal management
brew "yt-dlp" # Download all web videos
brew "koekeishiya/formulae/skhd" # Works in tandem with yabai below. Creating system wide keyboard shortcuts with CLI programs.
brew "koekeishiya/formulae/yabai" # Tiled Window manager for macOS. Automatically tile windows.
brew "mas" # Application to install apps from the App Store using CLI
brew "btop" # Better terminal activity monitor
brew "ranger" # Terminal file manager
brew "speedtest-cli" # Terminal speed test
brew "lsd" # Better ls command. With icons.
brew "zsh-syntax-highlighting" # Terminal syntax highlight
brew "zsh-autosuggestions" # Terminal auto complete
brew "powerlevel10k" # Terminal theme

# Install fonts for powerlevel10k (optional)
cask "font-hack-nerd-font" # Example font

# GUI Apps
cask "1password" # The best password manager. Require a subscription.
cask "arc" # Modern web browser with minimal UI.
cask "chatgpt" # AI chat application with access to the latest and best models.
cask "discord" # Gaming chat, Bellingcat, and app support channels
cask "hyperkey" # Make Caps Lock useful by turning it into a one-button ctrl+shift+option+command, which allows for more and easier keyboard shortcuts.
cask "keka" # App to uncompress and compress files. Unlike macOS native it also supports RAR.
cask "shutter-encoder" # Free media conversion app with web video download
cask "iina" # Video player based on mpv, but optimized for macOS. Supports as many formats as VLC, but looks better.
cask "obs" # Screenrecording tool with audio meters and custom PiP
cask "raycast" # Fast app launching, clipboard history, window management, AI quick-fixes
cask "slack" # Business communication
cask "visual-studio-code" # Fast free code editor
cask "zed" # Programming application like VSCode, but written in Rust.
cask "msty" # Local and cloud LMM GUI
cask "xcode" # Swift UI programming
cask "docker" # Run Docker-images. Label Studio for example.
cask "adobe-dng-converter" # Tool to convert RAW files to DNG
cask "shottr" # Screenshotting tool – Licence in 1Password
cask "stats" # Menu bar activity monitor
cask "wezterm" # Better terminal than default. More private than Warp


# Mac App Store Apps
mas "Affinity Designer 2", id: 1616831348 # Like Adobe Illustrator without a subscription
mas "Affinity Photo 2", id: 1616822987 # Like Adobe Photoshop without a subscription
mas "Affinity Publisher 2", id: 1606941598 # Like Adobe InDesign without a subscription
mas "Charmstone", id: 1563735522 # Smart shortcut when dragging files. Quickly move to common folders or open in common apps.
mas "Elmedia Video Player", id: 1044549675 # Supports many file formats and chrome cast and airplay.
mas "Final Cut Pro", id: 424389933 # Fast video editor
mas "Hidden Bar", id: 1452453066 # With all this cool apps the top right menu bar can become cluttered. This free app hides some of the clutter.
mas "Infuse", id: 1136220934 # Movie player connected to NAS with iCloud sync
mas "Keynote", id: 409183694 # Presentation utility
mas "Logic Pro", id: 634148309 # Advanced music making program
mas "MediaInfo", id: 510620098 # Check metadata of all image files. Pro licence can be restored.
mas "Mountain Duck", id: 1024974133 # Mount FTP servers as local drives.
mas "Numbers", id: 409203825 # Excel alternative with iCloud sync.
mas "Pages", id: 409201541 # Word alternative.
mas "PopClip", id: 445189367 # Smart popup commands with text selection.
mas "Ulysses", id: 1225570693 # Minimalist writing tool for novels.
mas "Messenger", id: 1480068668 # Facebook messenger app.
mas "Microsoft Teams", id: 1091189122 # Video meetings.
mas "Microsoft Word", id: 462054704 # Writing app.
mas "Microsoft Excel", id: 462058435 # Spreadcheat app.
mas "Microsoft PowerPoint", id: 462062816 # Presentations.
mas "Microsoft Outlook", id: 985367838 # Mail and meeting calendar.



# Adobe Creative Cloud
## Adobe Bridge
## Lightroom
## Photoshop
## Premiere Pro

# Other apps that need manual installation
## Photo Mechanic
## DaVinci Resolve Studio – Can be automated via mas, but for python scripting it's best getting directly from Blackmagic Design.
